Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope
Indicates the determination method for the building envelope
Since:
2015

Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope.IdentifyExteriorElements
This method uses a combination of ray-casting and flood-fill algorithms in order to identify the building elements that are
exposed to the outside of the building, the building envelope. Analytical surface originated from the building elements in the envelope
will be classified as exterior or shading surfaces.

Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope.UseFunctionParameter
This method uses the Function type parameter of Walls, Floors and Building Pads to determinate the building elements considered to be part of the building envelope.
If a wall has one adjacent space, analytical surface originated from the wall will be classified as exterior surfaces.
If a wall has two adjacent spaces and its function is Exterior, Foundation, Retaining, or Soffit, analytical surface originated from the wall will be classified
as interior surfaces.
If thw wall's function is Interior or Core Shaft, analytical surface originated from the wall will be classfied interior surfaces, regardless of the number of adjacent spaces.